#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/f0d51ea2-855b-4c05-85d4-e7e301600a5e/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["my-project-91055-366623"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "my-project-91055-366623"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["my-project-91055-366623"].module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = true
      + billing_account     = "016AE0-A1405C-5DF4D8"
      + folder_id           = "646444353292"
      + id                  = (known after apply)
      + labels              = {
          + "cost-center"   = "123456"
          + "project-owner" = "luis"
          + "tech-owner"    = "pedro-mendez"
        }
      + name                = "my-project-91055-366623"
      + number              = (known after apply)
      + project_id          = "my-project-91055-366623"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["my-project-91055-366623"].module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = "my-project-91055-366623 Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "my-project-91055-366623"
      + unique_id    = (known after apply)
    }

  # module.project-factory["my-project-91055-366623"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "new-luis-lhw3"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["my-project-91055-366623"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "my-project-91055-366623"
      + service                    = "compute.googleapis.com"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["my-project-91055-366623"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "my-project-91055-366623"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["my-project-91055-366623"].module.project-factory.google_project.main will be created%0A  + resource "google_project" "main" {%0A      + auto_create_network = true%0A      + billing_account     = "016AE0-A1405C-5DF4D8"%0A      + folder_id           = "646444353292"%0A      + id                  = (known after apply)%0A      + labels              = {%0A          + "cost-center"   = "123456"%0A          + "project-owner" = "luis"%0A          + "tech-owner"    = "pedro-mendez"%0A        }%0A      + name                = "my-project-91055-366623"%0A      + number              = (known after apply)%0A      + project_id          = "my-project-91055-366623"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["my-project-91055-366623"].module.project-factory.google_service_account.default_service_account[0] will be created%0A  + resource "google_service_account" "default_service_account" {%0A      + account_id   = "project-service-account"%0A      + disabled     = false%0A      + display_name = "my-project-91055-366623 Project Service Account"%0A      + email        = (known after apply)%0A      + id           = (known after apply)%0A      + member       = (known after apply)%0A      + name         = (known after apply)%0A      + project      = "my-project-91055-366623"%0A      + unique_id    = (known after apply)%0A    }%0A%0A  # module.project-factory["my-project-91055-366623"].module.project-factory.random_id.random_project_id_suffix will be created%0A  + resource "random_id" "random_project_id_suffix" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 2%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "new-luis-lhw3"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["my-project-91055-366623"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = true%0A      + id                         = (known after apply)%0A      + project                    = "my-project-91055-366623"%0A      + service                    = "compute.googleapis.com"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @luismendezescobar, Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*